In [201]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt
import sklearn

In [202]:
from dis import dis


account_data = pd.read_csv('data/account.csv', sep=";")
card_data = pd.read_csv('data/card_dev.csv', sep=";")
client_data = pd.read_csv('data/client.csv', sep=";")
disp_data = pd.read_csv('data/disp.csv', sep=";")
district_data = pd.read_csv('data/district.csv', sep=";")
loan_data = pd.read_csv('data/loan_dev.csv', sep=";")
trans_data = pd.read_csv('data/trans_dev.csv', sep=";")

C:\Users\Francisco\AppData\Local\Temp\ipykernel_9224\2076448092.py:10: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  trans_data = pd.read_csv('data/trans_dev.csv', sep=";")

In [203]:
# client_data["sex"] = client_data.apply(lambda row: 'Female' if row.birth_number %10000 >= 5000 else 'Male')
client_data['sex'] = np.where(client_data['birth_number'] % 10000>5000, 'Female','Male')

In [204]:
client_data['birth_number'] = np.where(client_data['birth_number'] % 10000>5000, client_data['birth_number']-5000,client_data['birth_number'])

In [205]:
print(client_data)

      client_id  birth_number  district_id     sex
0             1        701213           18  Female
1             2        450204            1    Male
2             3        401009            1  Female
3             4        561201            5    Male
4             5        600703            5  Female
...         ...           ...          ...     ...
5364      13955        451030            1  Female
5365      13956        430406            1    Male
5366      13968        680413           61    Male
5367      13971        621019           67  Female
5368      13998        530812           74  Female

[5369 rows x 4 columns]

In [206]:
client_data.rename(columns={'district_id':'client_district'}, inplace=True)
account_data.rename(columns={'district_id':'account_district'}, inplace=True)

In [207]:
client_disp_merge = client_data.merge(disp_data, on=["client_id"])

In [214]:
account_merge = client_disp_merge.merge(account_data,on=["account_id"])

In [217]:
account_merge

,client_id,birth_number,client_district,sex,disp_id,account_id,type,account_district,frequency,date
0,1,701213,18,Female,1,1,OWNER,18,monthly issuance,950324
1,2,450204,1,Male,2,2,OWNER,1,monthly issuance,930226
2,3,401009,1,Female,3,2,DISPONENT,1,monthly issuance,930226
3,4,561201,5,Male,4,3,OWNER,5,monthly issuance,970707
4,5,600703,5,Female,5,3,DISPONENT,5,monthly issuance,970707
...,...,...,...,...,...,...,...,...,...,...
5364,13955,451030,1,Female,13647,11349,OWNER,1,weekly issuance,950526
5365,13956,430406,1,Male,13648,11349,DISPONENT,1,weekly issuance,950526
5366,13968,680413,61,Male,13660,11359,OWNER,61,monthly issuance,941001
5367,13971,621019,67,Female,13663,11362,OWNER,67,monthly issuance,951014
5368,13998,530812,74,Female,13690,11382,OWNER,74,monthly issuance,950820

In [215]:
# card_merge = account_merge.merge(card_data,on=["disp_id"])

In [ ]:
# print(card_merge)

In [218]:
loan_merge = account_merge.merge(loan_data,on=["account_id"])

In [219]:
loan_merge

,client_id,birth_number,client_district,sex,disp_id,account_id,type,account_district,frequency,date_x,loan_id,date_y,amount,duration,payments,status
0,2,450204,1,Male,2,2,OWNER,1,monthly issuance,930226,4959,940105,80952,24,3373,1
1,3,401009,1,Female,3,2,DISPONENT,1,monthly issuance,930226,4959,940105,80952,24,3373,1
2,25,390423,21,Female,25,19,OWNER,21,monthly issuance,950407,4961,960429,30276,12,2523,-1
3,78,440613,16,Female,78,67,OWNER,16,monthly issuance,941019,4973,960502,165960,24,6915,1
4,158,450703,40,Female,158,132,OWNER,40,issuance after transaction,960511,4996,961106,88440,12,7370,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
398,13845,730216,15,Male,13537,11265,OWNER,15,monthly issuance,930114,7284,930915,52788,12,4399,1
399,13955,451030,1,Female,13647,11349,OWNER,1,weekly issuance,950526,7304,951029,419880,60,6998,1
400,13956,430406,1,Male,13648,11349,DISPONENT,1,weekly issuance,950526,7304,951029,419880,60,6998,1
401,13968,680413,61,Male,13660,11359,OWNER,61,monthly issuance,941001,7305,960806,54024,12,4502,1
402,13971,621019,67,Female,13663,11362,OWNER,67,monthly issuance,951014,7308,961227,129408,24,5392,1

In [194]:
# trans_merge = loan_merge.merge(trans_data,on=["account_id"])

In [195]:
district_data.rename(columns={'code ':'client_district'}, inplace=True)

In [196]:
dataset = loan_merge.merge(district_data, on=['client_district'])

In [197]:
dataset = dataset.drop_duplicates()

In [198]:
dataset.to_csv('dataset.csv')

In [199]:
# np.where(dataset['district_id_x'] == dataset['district_id_y'], district_data['district_id_x'], 'NaN')
# dataset['client_district'].equals(dataset['account_district'])

In [200]:
dataset

,client_id,birth_number,client_district,sex,disp_id,account_id,type_x,account_district,frequency,date_x,...,no. of municipalities with inhabitants 2000-9999,no. of municipalities with inhabitants >10000,no. of cities,ratio of urban inhabitants,average salary,unemploymant rate '95,unemploymant rate '96,no. of enterpreneurs per 1000 inhabitants,no. of commited crimes '95,no. of commited crimes '96
0,655,421210,32,Male,655,544,OWNER,32,monthly issuance,950515,...,7,2,10,81.0,9272,2.80,3.22,118,4340,4505
1,2141,510906,28,Male,2141,1766,OWNER,28,monthly issuance,940903,...,10,0,8,36.9,8594,1.62,2.01,112,1580,1525
2,3687,720206,49,Male,3687,3050,OWNER,60,monthly issuance,930508,...,5,1,9,60.8,8208,1.89,2.26,155,1660,2123
3,5433,750924,50,Male,5433,4503,OWNER,50,monthly issuance,950103,...,2,3,6,52.0,8187,4.83,5.45,94,2123,2134
4,9427,701109,62,Female,9119,7614,OWNER,62,monthly issuance,950208,...,13,2,5,40.7,8544,1.29,1.86,109,2719,2906
5,9593,680128,74,Female,9285,7753,OWNER,74,monthly issuance,930208,...,0,1,1,100.0,10673,4.75,5.44,100,18782,18347
6,12050,430530,52,Male,11742,9790,OWNER,52,monthly issuance,951109,...,8,3,10,61.9,8363,2.52,3.49,108,2564,2799
7,12810,641014,39,Male,12502,10411,OWNER,39,issuance after transaction,951123,...,3,2,4,89.9,10446,7.34,9.40,90,4947,4743
8,12943,701012,55,Male,12635,10520,OWNER,55,issuance after transaction,951024,...,18,0,9,33.9,8743,1.88,2.43,111,3659,3894
9,13576,740707,72,Male,13268,11042,OWNER,72,monthly issuance,950129,...,7,4,4,62.6,8994,3.80,4.79,110,9672,9208
10,13968,680413,61,Male,13660,11359,OWNER,61,monthly issuance,941001,...,5,1,6,53.8,8814,4.76,5.74,107,2112,2059